package task2;

public class Task11 {
	public static void main(String[] args) {
//		2. 평균 성적, 평균 학점 계산
//		  사용자로부터 3과목의 점수를 각각 입력받고 주어진 표에 맞게 계산하여 평균 학점과 평균 성적을 계산하시오
//		  <표>
//		    점수   ㅣ  등급  ㅣ    학점
//		ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
//		   95-100 ㅣ   A+  ㅣ   (4.5)
//		   90-94  ㅣ   A    ㅣ    (4.0)
//		   85-89  ㅣ   B+  ㅣ    (3.5)
//		   80-84  ㅣ   B    ㅣ    (3)
//		   75-79  ㅣ   C+  ㅣ   (2.5)
//		   75미만  ㅣ   F   ㅣ    (0)
//
//		[출력 예시1]
//		3과목의 성적을 입력해 주세요 : 90 89 98
//		평균 학점 : 4.0
//		평균 성적 : A
//
//		[출력 예시2]
//		3과목의 성적을 입력해 주세요 : 74 74 74
//		평균 학점 : 0.0
//		평균 성적 : F 
	}
}
